trade_exp/src/Catalogs/СегментыПартнеров/СегментыПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СегментыПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СпособФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроверятьНаВхождениеПриСозданииНового</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОчистки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничениеВыбораСегмента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a4b5da3-533c-4444-b36f-b311fb921d97">
    <name>ВыгружатьНаСайт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПартнерыПоСегменту</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/СегментыПартнеров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура Спр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПраваДляИзменения = ПроверитьПрава();
	
	Элементы.ОграничениеВыбораСегмента.Доступность = ПраваДляИзменения;
	Элементы.Сформировать.Доступность = ПраваДляИзменения;
	Элементы.ПроверятьНаВхождениеПриСозданииНового.Доступность = ПраваДляИзменения; 
	Элементы.ЗапретОтгрузки.Доступность = ПраваДляИзменения;
	Элементы.ОграничениеВыбораСегмента.Доступность = ПраваДляИзменения; 
	Элементы.ВыгружатьНаСайт.Доступность = ПраваДляИзменения;   
	
	Если Элементы.Найти("РазрешитьРедактированиеРеквизитовОбъекта") <> Неопределено Тогда
		Элементы.РазрешитьРедактированиеРеквизитовОбъекта.Доступность = ПраваДляИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПрава() 
	Возврат (рольДоступна("ПолныеПрава") или рольДоступна("ДобавлениеИзменениеСегментовПартнеров_ОтделАналитики"));
КонецФункции	

&НаКлиенте
&После("УправлениеДоступностью")
Процедура Док_УправлениеДоступностью()
	ПраваДляИзменения = ПроверитьПрава(); 
	Элементы.ПроверятьНаВхождениеПриСозданииНового.Доступность = ПраваДляИзменения; 
КонецПроцедуры
